README.md
```mermaid
classDiagram
    direction TB

    class Usuario {
        +int id
        +String nome
        +String email
        +String senhaHash
        +Perfil perfil
        +login(email, senha) String
        +verificarToken(token) Payload
    }

    class Movimentacao {
        +String id
        +String placa
        +TipoMovimentacao tipo
        +DateTime dataHoraEntrada
        +DateTime dataHoraSaida
        +StatusMovimentacao status
        +calcularPermanenciaMin() int
        +finalizar() void
    }

    class Mensalista {
        +String id
        +String nome
        +String cpf
        +String placa
        +Date vencimento
        +StatusMensalista status
        +verificarAdimplencia() bool
    }

    class Pagamento {
        +String id
        +String movimentacaoId
        +float valorCalculado
        +float valorPago
        +FormaPagamento forma
        +StatusPagamento status
        +calcularValor(min, tabela) float
        +confirmar() void
    }

    class TabelaPreco {
        +String id
        +String descricao
        +float valorPorHora
        +int carenciaMinutos
        +Date vigenciaInicio
        +Date vigenciaFim
        +aplicarCarencia(min) float
    }

    class Vaga {
        +String id
        +String codigo
        +int andar
        +TipoVaga tipo
        +StatusVaga status
        +ocupar() void
        +liberar() void
        +bloquear() void
    }

    class Perfil {
        <<enumeration>>
        ADMIN
        OPERADOR
    }

    class TipoMovimentacao {
        <<enumeration>>
        ROTATIVO
        MENSALISTA
    }

    class StatusMovimentacao {
        <<enumeration>>
        ABERTA
        AGUARDANDO_PAGAMENTO
        FINALIZADA
        CANCELADA
    }

    class StatusMensalista {
        <<enumeration>>
        EM_DIA
        INADIMPLENTE
        BLOQUEADO
        INATIVO
    }

    class StatusVaga {
        <<enumeration>>
        LIVRE
        OCUPADA
        INDISPONIVEL
    }

    class TipoVaga {
        <<enumeration>>
        COMUM
        PCD
        IDOSO
        GESTANTE
        ELETRICO
    }

    class FormaPagamento {
        <<enumeration>>
        DINHEIRO
        CARTAO
        PIX
    }

    class StatusPagamento {
        <<enumeration>>
        PENDENTE
        CONFIRMADO
        CANCELADO
    }

    Usuario --> Perfil
    Movimentacao --> TipoMovimentacao
    Movimentacao --> StatusMovimentacao
    Movimentacao "1" --> "0..1" Pagamento : gera
    Pagamento --> TabelaPreco : usa regras de
    Pagamento --> FormaPagamento
    Pagamento --> StatusPagamento
    Mensalista --> StatusMensalista
    Vaga --> StatusVaga
    Vaga --> TipoVaga
```
